let 지역목록 = [
    { 지역번호 : 1 , 지역명 : "인천" },
    { 지역번호 : 2 , 지역명 : "서울" }
   ];
let 지점목록 = [
    { 지점번호 : 1 , 지점명 : "주안", 지역번호 : 1},
    { 지점번호 : 2, 지점명 : "루원시티", 지역번호 : 1},
    { 지점번호 : 3, 지점명 : "영등포", 지역번호 : 2}
];
let 영화목록 = [
    { 영화번호 : 1, 영화제목 : "포레스트검프", 상영날짜 : "12-03", 지점번호 : 1},
    { 영화번호 : 2, 영화제목 : "타짜", 상영날짜 : "12-04", 지점번호 : 1},
    { 영화번호 : 3, 영화제목 : "모아나", 상영날짜 : "12-05", 지점번호 : 2}
]
let 상영관목록 = [
    { 상영관번호 : 1, 상영관명 : "a관", 상영시간 : "12:00", 영화번호 : 1},
    { 상영관번호 : 2, 상영관명 : "b관", 상영시간 : "13:00", 영화번호 : 2},
    { 상영관번호 : 2, 상영관명 : "b관", 상영시간 : "20:00", 영화번호 : 3},
]